print("--- โปรแกรมคำนวณพื้นที่ ---")
print("1. พื้นที่สี่เหลี่ยมมุมฉาก")
print("2. พื้นที่สามเหลี่ยม")
ตัวเลือก = input("เลือกเมนู (1 หรือ 2): ")

if ตัวเลือก == "1":
    กว้าง = float(input("ใส่ความกว้าง: "))
    ยาว = float(input("ใส่ความยาว: "))
    พื้นที่ = กว้าง * ยาว
    print("พื้นที่สี่เหลี่ยมคือ:", พื้นที่)
    
elif ตัวเลือก == "2":
    ฐาน = float(input("ใส่ความยาวฐาน: "))
    สูง = float(input("ใส่ความสูง: "))
    พื้นที่ = 0.5 * ฐาน * สูง
    print("พื้นที่สามเหลี่ยมคือ:", พื้นที่)
    
else:
    print("เลือกเมนูไม่ถูกต้อง กรุณาลองใหม่")